//index.js
//获取应用实例
const app = getApp()
const utils = require('../../utils/util');
const dialog = require('../../utils/dialog');

Page({
  data: {
    motto: 'Hello World',
    sysInfo:{},
    swiperMenuData: {
      swiperIndex: 0,
      swiperScrollLeft: 0,
    },
    swiperData: [{
      name: '前端',
      list:[
        {
          title:'我是博客1我我是博客1我是博客1我我是博客1我是博客1我我是博客1',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'
        },{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客1',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'
        },{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客1',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'
        },{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客1',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'
        },{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    }, {
      name: '后台',
      list:[
        {
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    },{
      name: '运维',
      list:[{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    },{
      name: 'JAVA',
      list:[{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    },{
      name: 'IOS',
      list:[{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    },{
      name: 'IOS',
      list:[{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    },{
      name: 'IOS',
      list:[{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    },{
      name: 'IOS',
      list:[{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    },{
      name: 'IOS',
      list:[{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    },{
      name: 'IOS',
      list:[{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    },{
      name: 'IOS',
      list:[{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    },{
      name: 'IOS',
      list:[{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    },{
      name: 'IOS',
      list:[{
          title:'我是博客2',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        },{
          title:'我是博客3',
          summary:'这个跟计算机的数据结构,编码格式有关,一般说来,拿我们常用的来说,在gbk编码中,中文占2个字节,英文和数字占1个字节,你说的特殊字符,标点符号也是根据中英文区分的,也就是全角或者半角,在utf-8编码中,中文占3个字节,英文和数字还是1个字节.'          
        }
      ]
    }]
  },
  onLoad: function () {
    // 获取系统信息
    let sysInfo=wx.getSystemInfoSync();
    this.setData({
      sysInfo
    })    
    utils.requestFn({
        method: 'GET',
        url: ['/users/list', '/users/list']
      })
      .then((res) => {
        console.log(res);
      }).catch(err => {
        console.log(err);
      });
  },
  // swiper滚动事件，切换menu
  swiperChangeFn: function (e) {
    let that = this;
    let _currentIndex = e.detail.current;
    var query = wx.createSelectorQuery();
    query.selectAll('.simMenuItem').boundingClientRect().selectViewport();
    query.exec(function(res){
      // 获取当前点击节点的信息      
      let _currentDom=res[0][_currentIndex];
      // 获取宽度
      let _currentLength=_currentDom.width;
      // 获取距离左边的距离 
      let _currentToLeft=0;
      for(let i=0; i<_currentIndex;i++){
        _currentToLeft+=res[0][i].width;
      }
      let _currentScrollLeft=( _currentToLeft + (_currentLength/2) - (that.data.sysInfo.screenWidth/2));
      that.setData({
        "swiperMenuData.swiperScrollLeft": _currentScrollLeft,
      "swiperMenuData.swiperIndex": _currentIndex      
      });
    });
  },
  // menu点击事件
  menuChangeFn: function (e) {
    let _index = e.currentTarget.dataset.index || e.target.dataset.index;
    this.setData({
      "swiperMenuData.swiperIndex": _index
    })
  },
  // 前往首页菜单展示界面
  goMenuShowSettingFn:function(){
    wx.navigateTo({
      url: '/pages/menuSetting/menuSetting',
      success: function(res){
      },
      fail: function() {
      },
      complete: function() {
      }
    })
  },
  showModal: function () {
    dialog.showModal({
      title: '我是标题',
      text: '我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容',
      textAlgin: 'center',
      submitText: '确定',
      submitTextColor: 'green',
      submitBackgroundColor: '#fff',
      showCancle: true,
      cancleText: '取消',
      cancleTextColor: '#333',
      cancleBackgroundColor: '#fff',
      mask: true,
      maskEvent: true,
      success: function () {
        console.log('点击确认');
      },
      fail: function (err) {
        console.log('点击取消', err);
      },
      complete: function () {
        console.log('调用完成');
      }
    });
  },
  showTips: function () {
    dialog.showTips({
      text: '你好',
      textAlgin: 'center',
      position: 'bottom',
      time: 3000
    })
  }
})